---
kind: type
id: T:Autodesk.Revit.DB.Electrical.CableTrayConduitBase
source: html/8a5c2986-28de-9e30-cb9f-c6997bff3940.htm
---
# Autodesk.Revit.DB.Electrical.CableTrayConduitBase

The CableTrayConduitBase class is implemented as the base class for cable tray or conduit

## Syntax (C#)
```csharp
public class CableTrayConduitBase : MEPCurve
```